; ModuleID = 'final.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.RTFTypeMap = type { i8*, i32 }
%struct.cp_map = type { i16, i8* }
%struct.oleEntry = type { %struct._IO_FILE*, [33 x i8], i64, i64, i64, i64, i64, i8*, i32, i64, i64*, i32 }
%struct.glob_t = type { i64, i8**, i64, i32, void (i8*)*, i8* (i8*)*, i8* (i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct.RTFcommand = type { i32, [33 x i8], i32 }
%struct.RTFGroupData = type { i32, %struct.RTFStyle* }
%struct.RTFStyle = type { i32 }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [11 x i8] c"[PC] 0x%x\0A\00", align 1
@.str.1 = private unnamed_addr constant [16 x i8] c"[STRCMP] %s %s\0A\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"CMP\00", align 1
@.str.6 = private unnamed_addr constant [23 x i8] c"[%s] [0x%x] 0x%x 0x%x\0A\00", align 1
@.str.3 = private unnamed_addr constant [10 x i8] c"SWITCH-16\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"SWITCH-32\00", align 1
@.str.5 = private unnamed_addr constant [10 x i8] c"SWITCH-64\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "signature_check", scope: !2, file: !3, line: 21, type: !16, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !20)
!3 = !DIFile(filename: "catdoc.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!4 = !{}
!5 = !{!6, !9, !11, !14, !15, !16, !17}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 62, baseType: !8)
!7 = !DIFile(filename: "/data2/zhangzheng1/tools/llvm-6.0/usr/local/lib/clang/6.0.0/include/stddef.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !{!0, !21, !23, !25, !87, !89}
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "forced_charset", scope: !2, file: !3, line: 22, type: !16, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "wrap_margin", scope: !2, file: !3, line: 23, type: !16, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "get_unicode_char", scope: !2, file: !3, line: 24, type: !27, isLocal: false, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!16, !30, !86, !62}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 48, baseType: !33)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !34, line: 241, size: 1728, elements: !35)
!34 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !56, !57, !58, !59, !63, !65, !67, !71, !74, !76, !77, !78, !79, !80, !81, !82}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !33, file: !34, line: 242, baseType: !16, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !33, file: !34, line: 247, baseType: !14, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !33, file: !34, line: 248, baseType: !14, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !33, file: !34, line: 249, baseType: !14, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !33, file: !34, line: 250, baseType: !14, size: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !33, file: !34, line: 251, baseType: !14, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !33, file: !34, line: 252, baseType: !14, size: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !33, file: !34, line: 253, baseType: !14, size: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !33, file: !34, line: 254, baseType: !14, size: 64, offset: 512)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !33, file: !34, line: 256, baseType: !14, size: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !33, file: !34, line: 257, baseType: !14, size: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !33, file: !34, line: 258, baseType: !14, size: 64, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !33, file: !34, line: 260, baseType: !49, size: 64, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !34, line: 156, size: 192, elements: !51)
!51 = !{!52, !53, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !50, file: !34, line: 157, baseType: !49, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !50, file: !34, line: 158, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !50, file: !34, line: 162, baseType: !16, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !33, file: !34, line: 262, baseType: !54, size: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !33, file: !34, line: 264, baseType: !16, size: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !33, file: !34, line: 268, baseType: !16, size: 32, offset: 928)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !33, file: !34, line: 270, baseType: !60, size: 64, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !61, line: 131, baseType: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!62 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !33, file: !34, line: 274, baseType: !64, size: 16, offset: 1024)
!64 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !33, file: !34, line: 275, baseType: !66, size: 8, offset: 1040)
!66 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !33, file: !34, line: 276, baseType: !68, size: 8, offset: 1048)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !33, file: !34, line: 280, baseType: !72, size: 64, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !34, line: 150, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !33, file: !34, line: 289, baseType: !75, size: 64, offset: 1152)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !61, line: 132, baseType: !62)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !33, file: !34, line: 297, baseType: !15, size: 64, offset: 1216)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !33, file: !34, line: 298, baseType: !15, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !33, file: !34, line: 299, baseType: !15, size: 64, offset: 1344)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !33, file: !34, line: 300, baseType: !15, size: 64, offset: 1408)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !33, file: !34, line: 302, baseType: !6, size: 64, offset: 1472)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !33, file: !34, line: 303, baseType: !16, size: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !33, file: !34, line: 305, baseType: !83, size: 160, offset: 1568)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "input_buffer", scope: !2, file: !3, line: 26, type: !14, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "output_buffer", scope: !2, file: !3, line: 26, type: !14, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "buffer", scope: !93, file: !94, line: 13, type: !120, isLocal: false, isDefinition: true)
!93 = distinct !DICompileUnit(language: DW_LANG_C99, file: !94, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !111, globals: !112)
!94 = !DIFile(filename: "reader.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!95 = !{!96}
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 46, size: 32, elements: !98)
!97 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!99 = !DIEnumerator(name: "_ISupper", value: 256)
!100 = !DIEnumerator(name: "_ISlower", value: 512)
!101 = !DIEnumerator(name: "_ISalpha", value: 1024)
!102 = !DIEnumerator(name: "_ISdigit", value: 2048)
!103 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!104 = !DIEnumerator(name: "_ISspace", value: 8192)
!105 = !DIEnumerator(name: "_ISprint", value: 16384)
!106 = !DIEnumerator(name: "_ISgraph", value: 32768)
!107 = !DIEnumerator(name: "_ISblank", value: 1)
!108 = !DIEnumerator(name: "_IScntrl", value: 2)
!109 = !DIEnumerator(name: "_ISpunct", value: 4)
!110 = !DIEnumerator(name: "_ISalnum", value: 8)
!111 = !{!14, !19, !62, !16, !64}
!112 = !{!91, !113, !118}
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "read_buf", scope: !93, file: !94, line: 14, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 256)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "buf_is_unicode", scope: !93, file: !94, line: 15, type: !16, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 4194304, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 262144)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "para_double_newline", scope: !125, file: !126, line: 25, type: !16, isLocal: false, isDefinition: true)
!125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !126, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !127, globals: !128)
!126 = !DIFile(filename: "writer.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!127 = !{!15}
!128 = !{!123, !129, !149}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "bufpos", scope: !131, file: !126, line: 28, type: !16, isLocal: true, isDefinition: true)
!131 = distinct !DISubprogram(name: "out_char", scope: !126, file: !126, line: 27, type: !132, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, unit: !125, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !11}
!134 = !{!135, !136, !137, !138, !139, !142, !145, !146}
!135 = !DILocalVariable(name: "chunk", arg: 1, scope: !131, file: !126, line: 27, type: !11)
!136 = !DILocalVariable(name: "eol_flag", scope: !131, file: !126, line: 29, type: !16)
!137 = !DILocalVariable(name: "p", scope: !131, file: !126, line: 30, type: !11)
!138 = !DILocalVariable(name: "q", scope: !131, file: !126, line: 30, type: !14)
!139 = !DILocalVariable(name: "q", scope: !140, file: !126, line: 48, type: !14)
!140 = distinct !DILexicalBlock(scope: !141, file: !126, line: 46, column: 16)
!141 = distinct !DILexicalBlock(scope: !131, file: !126, line: 46, column: 6)
!142 = !DILocalVariable(name: "q", scope: !143, file: !126, line: 60, type: !14)
!143 = distinct !DILexicalBlock(scope: !144, file: !126, line: 59, column: 33)
!144 = distinct !DILexicalBlock(scope: !141, file: !126, line: 59, column: 13)
!145 = !DILocalVariable(name: "p", scope: !143, file: !126, line: 60, type: !14)
!146 = !DILocalVariable(name: "i", scope: !147, file: !126, line: 65, type: !16)
!147 = distinct !DILexicalBlock(scope: !148, file: !126, line: 63, column: 24)
!148 = distinct !DILexicalBlock(scope: !143, file: !126, line: 63, column: 7)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "outputbuffer", scope: !125, file: !126, line: 23, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 4096, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 512)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "rtf_sign", scope: !156, file: !157, line: 16, type: !238, isLocal: false, isDefinition: true)
!156 = distinct !DICompileUnit(language: DW_LANG_C99, file: !157, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !158, retainedTypes: !166, globals: !228)
!157 = !DIFile(filename: "analyze.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!158 = !{!159}
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !160, line: 22, size: 32, elements: !161)
!160 = !DIFile(filename: "./ole.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!161 = !{!162, !163, !164, !165}
!162 = !DIEnumerator(name: "oleDir", value: 1)
!163 = !DIEnumerator(name: "oleStream", value: 2)
!164 = !DIEnumerator(name: "oleRootDir", value: 5)
!165 = !DIEnumerator(name: "oleUnknown", value: 3)
!166 = !{!14, !15, !6, !9, !17, !11, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "oleEntry", file: !160, line: 42, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 29, size: 1024, elements: !170)
!170 = !{!171, !212, !216, !217, !218, !219, !220, !221, !223, !225, !226, !227}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !169, file: !160, line: 30, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 48, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !34, line: 241, size: 1728, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !174, file: !34, line: 242, baseType: !16, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !174, file: !34, line: 247, baseType: !14, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !174, file: !34, line: 248, baseType: !14, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !174, file: !34, line: 249, baseType: !14, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !174, file: !34, line: 250, baseType: !14, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !174, file: !34, line: 251, baseType: !14, size: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !174, file: !34, line: 252, baseType: !14, size: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !174, file: !34, line: 253, baseType: !14, size: 64, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !174, file: !34, line: 254, baseType: !14, size: 64, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !174, file: !34, line: 256, baseType: !14, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !174, file: !34, line: 257, baseType: !14, size: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !174, file: !34, line: 258, baseType: !14, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !174, file: !34, line: 260, baseType: !189, size: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !34, line: 156, size: 192, elements: !191)
!191 = !{!192, !193, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !190, file: !34, line: 157, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !190, file: !34, line: 158, baseType: !194, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !190, file: !34, line: 162, baseType: !16, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !174, file: !34, line: 262, baseType: !194, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !174, file: !34, line: 264, baseType: !16, size: 32, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !174, file: !34, line: 268, baseType: !16, size: 32, offset: 928)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !174, file: !34, line: 270, baseType: !60, size: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !174, file: !34, line: 274, baseType: !64, size: 16, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !174, file: !34, line: 275, baseType: !66, size: 8, offset: 1040)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !174, file: !34, line: 276, baseType: !68, size: 8, offset: 1048)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !174, file: !34, line: 280, baseType: !72, size: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !174, file: !34, line: 289, baseType: !75, size: 64, offset: 1152)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !174, file: !34, line: 297, baseType: !15, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !174, file: !34, line: 298, baseType: !15, size: 64, offset: 1280)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !174, file: !34, line: 299, baseType: !15, size: 64, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !174, file: !34, line: 300, baseType: !15, size: 64, offset: 1408)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !174, file: !34, line: 302, baseType: !6, size: 64, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !174, file: !34, line: 303, baseType: !16, size: 32, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !174, file: !34, line: 305, baseType: !83, size: 160, offset: 1568)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !160, line: 31, baseType: !213, size: 264, offset: 64)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 264, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 33)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "startBlock", scope: !169, file: !160, line: 32, baseType: !62, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "curBlock", scope: !169, file: !160, line: 33, baseType: !62, size: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !169, file: !160, line: 34, baseType: !8, size: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ole_offset", scope: !169, file: !160, line: 35, baseType: !62, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "file_offset", scope: !169, file: !160, line: 36, baseType: !62, size: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dirPos", scope: !169, file: !160, line: 37, baseType: !222, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !160, line: 38, baseType: !224, size: 32, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "oleType", file: !160, line: 27, baseType: !159)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "numOfBlocks", scope: !169, file: !160, line: 39, baseType: !62, size: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !169, file: !160, line: 40, baseType: !86, size: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "isBigBlock", scope: !169, file: !160, line: 41, baseType: !16, size: 32, offset: 960)
!228 = !{!154, !229, !234, !236}
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "old_word_sign", scope: !156, file: !157, line: 17, type: !231, isLocal: false, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 24, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 3)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "write_sign", scope: !156, file: !157, line: 18, type: !231, isLocal: false, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "verbose", scope: !156, file: !157, line: 19, type: !16, isLocal: false, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 48, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 6)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "rtf_types", scope: !243, file: !244, line: 67, type: !306, isLocal: false, isDefinition: true)
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !245, retainedTypes: !286, globals: !299)
!244 = !DIFile(filename: "rtfread.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!245 = !{!246, !96}
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !244, line: 21, size: 32, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!248 = !DIEnumerator(name: "RTF_CODEPAGE", value: 0)
!249 = !DIEnumerator(name: "RTF_FONT_CHARSET", value: 1)
!250 = !DIEnumerator(name: "RTF_UC", value: 2)
!251 = !DIEnumerator(name: "RTF_UNICODE_CHAR", value: 3)
!252 = !DIEnumerator(name: "RTF_CHAR", value: 4)
!253 = !DIEnumerator(name: "RTF_PARA", value: 5)
!254 = !DIEnumerator(name: "RTF_TABLE_START", value: 6)
!255 = !DIEnumerator(name: "RTF_TABLE_END", value: 7)
!256 = !DIEnumerator(name: "RTF_ROW", value: 8)
!257 = !DIEnumerator(name: "RTF_CELL", value: 9)
!258 = !DIEnumerator(name: "RTF_UNKNOWN", value: 10)
!259 = !DIEnumerator(name: "RTF_OVERLAY", value: 11)
!260 = !DIEnumerator(name: "RTF_PICT", value: 12)
!261 = !DIEnumerator(name: "RTF_F", value: 13)
!262 = !DIEnumerator(name: "RTF_AUTHOR", value: 14)
!263 = !DIEnumerator(name: "RTF_FONTTBL", value: 15)
!264 = !DIEnumerator(name: "RTF_INFO", value: 16)
!265 = !DIEnumerator(name: "RTF_STYLESHEET", value: 17)
!266 = !DIEnumerator(name: "RTF_COLORTBL", value: 18)
!267 = !DIEnumerator(name: "RTF_LISTOVERRIDETABLE", value: 19)
!268 = !DIEnumerator(name: "RTF_LISTTABLE", value: 20)
!269 = !DIEnumerator(name: "RTF_RSIDTBL", value: 21)
!270 = !DIEnumerator(name: "RTF_GENERATOR", value: 22)
!271 = !DIEnumerator(name: "RTF_DATAFIELD", value: 23)
!272 = !DIEnumerator(name: "RTF_LANG", value: 24)
!273 = !DIEnumerator(name: "RTF_PARD", value: 25)
!274 = !DIEnumerator(name: "RTF_TAB", value: 26)
!275 = !DIEnumerator(name: "RTF_SPEC_CHAR", value: 27)
!276 = !DIEnumerator(name: "RTF_EMDASH", value: 28)
!277 = !DIEnumerator(name: "RTF_ENDASH", value: 29)
!278 = !DIEnumerator(name: "RTF_EMSPACE", value: 30)
!279 = !DIEnumerator(name: "RTF_ENSPACE", value: 31)
!280 = !DIEnumerator(name: "RTF_BULLET", value: 32)
!281 = !DIEnumerator(name: "RTF_LQUOTE", value: 33)
!282 = !DIEnumerator(name: "RTF_RQUOTE", value: 34)
!283 = !DIEnumerator(name: "RTF_LDBLQUOTE", value: 35)
!284 = !DIEnumerator(name: "RTF_RDBLQUOTE", value: 36)
!285 = !DIEnumerator(name: "RTF_ZWNONJOINER", value: 37)
!286 = !{!287, !15, !16, !64, !13, !298}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTFGroupData", file: !244, line: 145, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !244, line: 142, size: 128, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "uc", scope: !289, file: !244, line: 143, baseType: !16, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !289, file: !244, line: 144, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTFStyle", file: !244, line: 136, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !244, line: 134, size: 32, elements: !296)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "codepage", scope: !295, file: !244, line: 135, baseType: !16, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!299 = !{!241, !300, !302}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "rtf_level", scope: !243, file: !244, line: 166, type: !16, isLocal: false, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "current_charset", scope: !243, file: !244, line: 165, type: !304, isLocal: false, isDefinition: true)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 4096, elements: !313)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTFTypeMap", file: !244, line: 65, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !244, line: 62, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !244, line: 63, baseType: !14, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !244, line: 64, baseType: !312, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTFTypes", file: !244, line: 60, baseType: !246)
!313 = !{!314}
!314 = !DISubrange(count: 32)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "charset_path", scope: !317, file: !318, line: 15, type: !14, isLocal: false, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !319, globals: !321)
!318 = !DIFile(filename: "charsets.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!319 = !{!320, !304, !16, !13}
!320 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!321 = !{!315, !322, !324, !326, !328, !333, !342, !347, !358, !369, !381, !384}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "source_csname", scope: !317, file: !318, line: 16, type: !14, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "dest_csname", scope: !317, file: !318, line: 16, type: !14, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "unknown_as_hex", scope: !317, file: !318, line: 18, type: !16, isLocal: false, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "bad_char", scope: !317, file: !318, line: 19, type: !330, isLocal: false, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 16, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 2)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "plain_char", scope: !335, file: !318, line: 203, type: !330, isLocal: true, isDefinition: true)
!335 = distinct !DISubprogram(name: "convert_char", scope: !318, file: !318, line: 202, type: !336, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !317, variables: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{!14, !16}
!338 = !{!339, !340, !341}
!339 = !DILocalVariable(name: "uc", arg: 1, scope: !335, file: !318, line: 202, type: !16)
!340 = !DILocalVariable(name: "mapped", scope: !335, file: !318, line: 205, type: !14)
!341 = !DILocalVariable(name: "c", scope: !335, file: !318, line: 206, type: !16)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "hexbuf", scope: !335, file: !318, line: 204, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 8)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "utfbuffer", scope: !349, file: !318, line: 235, type: !355, isLocal: true, isDefinition: true)
!349 = distinct !DISubprogram(name: "to_utf8", scope: !318, file: !318, line: 234, type: !350, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true, unit: !317, variables: !352)
!350 = !DISubroutineType(types: !351)
!351 = !{!14, !320}
!352 = !{!353, !354}
!353 = !DILocalVariable(name: "uc", arg: 1, scope: !349, file: !318, line: 234, type: !320)
!354 = !DILocalVariable(name: "count", scope: !349, file: !318, line: 237, type: !16)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 32, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 4)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "cp_to_charset", scope: !317, file: !318, line: 259, type: !360, isLocal: false, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 3712, elements: !367)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_map", file: !318, line: 254, size: 128, elements: !362)
!362 = !{!363, !366}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "codepage", scope: !361, file: !318, line: 255, baseType: !364, size: 16)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !365, line: 49, baseType: !64)
!365 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!366 = !DIDerivedType(tag: DW_TAG_member, name: "charset_name", scope: !361, file: !318, line: 256, baseType: !14, size: 64, offset: 64)
!367 = !{!368}
!368 = !DISubrange(count: 29)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "buffer", scope: !371, file: !318, line: 291, type: !378, isLocal: true, isDefinition: true)
!371 = distinct !DISubprogram(name: "charset_from_codepage", scope: !318, file: !318, line: 289, type: !372, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, unit: !317, variables: !374)
!372 = !DISubroutineType(types: !373)
!373 = !{!11, !320}
!374 = !{!375, !376}
!375 = !DILocalVariable(name: "codepage", arg: 1, scope: !371, file: !318, line: 289, type: !320)
!376 = !DILocalVariable(name: "cp", scope: !371, file: !318, line: 292, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 56, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 7)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "source_charset", scope: !317, file: !318, line: 17, type: !383, isLocal: false, isDefinition: true)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "target_charset", scope: !317, file: !318, line: 20, type: !386, isLocal: false, isDefinition: true)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHARSET", file: !387, line: 171, baseType: !388)
!387 = !DIFile(filename: "./catdoc.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !391, line: 195, baseType: !305)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "map_path", scope: !394, file: !395, line: 16, type: !14, isLocal: false, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !396, globals: !397)
!395 = !DIFile(filename: "substmap.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!396 = !{!16, !64, !320}
!397 = !{!392, !398, !400, !404}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "longest_sequence", scope: !394, file: !395, line: 18, type: !16, isLocal: false, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "spec_chars", scope: !394, file: !395, line: 15, type: !402, isLocal: false, isDefinition: true)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "SUBSTMAP", file: !387, line: 176, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "replacements", scope: !394, file: !395, line: 15, type: !402, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "format_name", scope: !408, file: !409, line: 22, type: !14, isLocal: false, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !410, retainedTypes: !749, globals: !750)
!409 = !DIFile(filename: "confutil.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!410 = !{!96, !411}
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !412, line: 41, size: 32, elements: !413)
!412 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!414 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!415 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!416 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!417 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!418 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!419 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!420 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!421 = !DIEnumerator(name: "DAY_1", value: 131079)
!422 = !DIEnumerator(name: "DAY_2", value: 131080)
!423 = !DIEnumerator(name: "DAY_3", value: 131081)
!424 = !DIEnumerator(name: "DAY_4", value: 131082)
!425 = !DIEnumerator(name: "DAY_5", value: 131083)
!426 = !DIEnumerator(name: "DAY_6", value: 131084)
!427 = !DIEnumerator(name: "DAY_7", value: 131085)
!428 = !DIEnumerator(name: "ABMON_1", value: 131086)
!429 = !DIEnumerator(name: "ABMON_2", value: 131087)
!430 = !DIEnumerator(name: "ABMON_3", value: 131088)
!431 = !DIEnumerator(name: "ABMON_4", value: 131089)
!432 = !DIEnumerator(name: "ABMON_5", value: 131090)
!433 = !DIEnumerator(name: "ABMON_6", value: 131091)
!434 = !DIEnumerator(name: "ABMON_7", value: 131092)
!435 = !DIEnumerator(name: "ABMON_8", value: 131093)
!436 = !DIEnumerator(name: "ABMON_9", value: 131094)
!437 = !DIEnumerator(name: "ABMON_10", value: 131095)
!438 = !DIEnumerator(name: "ABMON_11", value: 131096)
!439 = !DIEnumerator(name: "ABMON_12", value: 131097)
!440 = !DIEnumerator(name: "MON_1", value: 131098)
!441 = !DIEnumerator(name: "MON_2", value: 131099)
!442 = !DIEnumerator(name: "MON_3", value: 131100)
!443 = !DIEnumerator(name: "MON_4", value: 131101)
!444 = !DIEnumerator(name: "MON_5", value: 131102)
!445 = !DIEnumerator(name: "MON_6", value: 131103)
!446 = !DIEnumerator(name: "MON_7", value: 131104)
!447 = !DIEnumerator(name: "MON_8", value: 131105)
!448 = !DIEnumerator(name: "MON_9", value: 131106)
!449 = !DIEnumerator(name: "MON_10", value: 131107)
!450 = !DIEnumerator(name: "MON_11", value: 131108)
!451 = !DIEnumerator(name: "MON_12", value: 131109)
!452 = !DIEnumerator(name: "AM_STR", value: 131110)
!453 = !DIEnumerator(name: "PM_STR", value: 131111)
!454 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!455 = !DIEnumerator(name: "D_FMT", value: 131113)
!456 = !DIEnumerator(name: "T_FMT", value: 131114)
!457 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!458 = !DIEnumerator(name: "ERA", value: 131116)
!459 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!460 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!461 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!462 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!463 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!464 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!465 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!466 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!467 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!468 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!469 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!470 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!471 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!472 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!473 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!474 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!475 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!476 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!477 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!478 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!479 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!480 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!481 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!482 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!483 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!484 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!485 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!486 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!487 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!488 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!489 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!490 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!491 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!492 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!493 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!494 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!495 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!496 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!497 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!498 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!499 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!500 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!501 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!502 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!503 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!504 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!505 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!506 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!507 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!508 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!509 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!510 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!511 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!512 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!513 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!514 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!515 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!516 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!517 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!518 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!519 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!520 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!521 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!522 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!523 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!524 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!525 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131183)
!526 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!527 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!528 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!529 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!530 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!531 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!532 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!533 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!534 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!535 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!536 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!537 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!538 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!539 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!540 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!541 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!542 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!543 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!544 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!545 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!546 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!547 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!548 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!549 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!550 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!551 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!552 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!553 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!554 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!555 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!556 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!557 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!558 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!559 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!560 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!561 = !DIEnumerator(name: "CODESET", value: 14)
!562 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!563 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!564 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!565 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!566 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!567 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!568 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!569 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!570 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!571 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!572 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!573 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!574 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!575 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!576 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!577 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!578 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!579 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!580 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!581 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!582 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!583 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!584 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!585 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!586 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!587 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!588 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!589 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!590 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!591 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!592 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!593 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!594 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!595 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!596 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!597 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!598 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!599 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!600 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!601 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!602 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!603 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!604 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!605 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!606 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!607 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!608 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!609 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!610 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!611 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!612 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!613 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!614 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!615 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!616 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!617 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!618 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!619 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!620 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!621 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!622 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!623 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!624 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!625 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!626 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!627 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!628 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!629 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!630 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!631 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!632 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!633 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!634 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!635 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!636 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!637 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!638 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!639 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!640 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!641 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!642 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!643 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!644 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!645 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!646 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!647 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!648 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!649 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!650 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!651 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!652 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!653 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!654 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!655 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!656 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!657 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!658 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!659 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!660 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!661 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!662 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!663 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!664 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!665 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!666 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!667 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!668 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!669 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!670 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!671 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!672 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!673 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!674 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!675 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!676 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!677 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!678 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!679 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!680 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!681 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!682 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!683 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!684 = !DIEnumerator(name: "THOUSEP", value: 65537)
!685 = !DIEnumerator(name: "__GROUPING", value: 65538)
!686 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!687 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!688 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!689 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!690 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!691 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!692 = !DIEnumerator(name: "__YESSTR", value: 327682)
!693 = !DIEnumerator(name: "__NOSTR", value: 327683)
!694 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!695 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!696 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!697 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!698 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!699 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!700 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!701 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!702 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!703 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!704 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!705 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!706 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!707 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!708 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!709 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!710 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!711 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!712 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!713 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!714 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!715 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!716 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!717 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!718 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!719 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!720 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!721 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!722 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!723 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!724 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!725 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!726 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!727 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!728 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!729 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!730 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!731 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!732 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!733 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!734 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!735 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!736 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!737 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!738 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!739 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!740 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!741 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!742 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!743 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!744 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!745 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!746 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!747 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!748 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!749 = !{!16, !64, !6, !9, !17, !11}
!750 = !{!406, !751, !753}
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "runtime_locale_check", scope: !408, file: !409, line: 23, type: !16, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "locale_charset", scope: !408, file: !409, line: 95, type: !14, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "BBD", scope: !757, file: !758, line: 30, type: !222, isLocal: false, isDefinition: true)
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !158, retainedTypes: !759, globals: !816)
!758 = !DIFile(filename: "ole.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!759 = !{!15, !14, !760, !765, !224, !19, !13, !6, !9, !17, !11}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "oleEntry", file: !160, line: 42, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 29, size: 1024, elements: !763)
!763 = !{!764, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !762, file: !160, line: 30, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 48, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !34, line: 241, size: 1728, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !767, file: !34, line: 242, baseType: !16, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !767, file: !34, line: 247, baseType: !14, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !767, file: !34, line: 248, baseType: !14, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !767, file: !34, line: 249, baseType: !14, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !767, file: !34, line: 250, baseType: !14, size: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !767, file: !34, line: 251, baseType: !14, size: 64, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !767, file: !34, line: 252, baseType: !14, size: 64, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !767, file: !34, line: 253, baseType: !14, size: 64, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !767, file: !34, line: 254, baseType: !14, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !767, file: !34, line: 256, baseType: !14, size: 64, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !767, file: !34, line: 257, baseType: !14, size: 64, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !767, file: !34, line: 258, baseType: !14, size: 64, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !767, file: !34, line: 260, baseType: !782, size: 64, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !34, line: 156, size: 192, elements: !784)
!784 = !{!785, !786, !788}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !783, file: !34, line: 157, baseType: !782, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !783, file: !34, line: 158, baseType: !787, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !783, file: !34, line: 162, baseType: !16, size: 32, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !767, file: !34, line: 262, baseType: !787, size: 64, offset: 832)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !767, file: !34, line: 264, baseType: !16, size: 32, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !767, file: !34, line: 268, baseType: !16, size: 32, offset: 928)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !767, file: !34, line: 270, baseType: !60, size: 64, offset: 960)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !767, file: !34, line: 274, baseType: !64, size: 16, offset: 1024)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !767, file: !34, line: 275, baseType: !66, size: 8, offset: 1040)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !767, file: !34, line: 276, baseType: !68, size: 8, offset: 1048)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !767, file: !34, line: 280, baseType: !72, size: 64, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !767, file: !34, line: 289, baseType: !75, size: 64, offset: 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !767, file: !34, line: 297, baseType: !15, size: 64, offset: 1216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !767, file: !34, line: 298, baseType: !15, size: 64, offset: 1280)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !767, file: !34, line: 299, baseType: !15, size: 64, offset: 1344)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !767, file: !34, line: 300, baseType: !15, size: 64, offset: 1408)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !767, file: !34, line: 302, baseType: !6, size: 64, offset: 1472)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !767, file: !34, line: 303, baseType: !16, size: 32, offset: 1536)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !767, file: !34, line: 305, baseType: !83, size: 160, offset: 1568)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !160, line: 31, baseType: !213, size: 264, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "startBlock", scope: !762, file: !160, line: 32, baseType: !62, size: 64, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "curBlock", scope: !762, file: !160, line: 33, baseType: !62, size: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !762, file: !160, line: 34, baseType: !8, size: 64, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ole_offset", scope: !762, file: !160, line: 35, baseType: !62, size: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "file_offset", scope: !762, file: !160, line: 36, baseType: !62, size: 64, offset: 640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dirPos", scope: !762, file: !160, line: 37, baseType: !222, size: 64, offset: 704)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !762, file: !160, line: 38, baseType: !224, size: 32, offset: 768)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "numOfBlocks", scope: !762, file: !160, line: 39, baseType: !62, size: 64, offset: 832)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !762, file: !160, line: 40, baseType: !86, size: 64, offset: 896)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "isBigBlock", scope: !762, file: !160, line: 41, baseType: !16, size: 32, offset: 960)
!816 = !{!755, !817, !819, !821, !823, !825, !830, !835, !837, !839, !841, !843, !845, !847, !849, !851, !853, !855, !860, !865, !870}
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "SBD", scope: !757, file: !758, line: 33, type: !222, isLocal: false, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "rootEntry", scope: !757, file: !758, line: 34, type: !760, isLocal: false, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "properties", scope: !757, file: !758, line: 37, type: !222, isLocal: false, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "fileLength", scope: !757, file: !758, line: 38, type: !62, isLocal: false, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "ole_sign", scope: !757, file: !758, line: 40, type: !827, isLocal: false, isDefinition: true)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 72, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 9)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "zip_sign", scope: !757, file: !758, line: 41, type: !832, isLocal: false, isDefinition: true)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 40, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 5)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "sectorSize", scope: !757, file: !758, line: 27, type: !62, isLocal: false, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "shortSectorSize", scope: !757, file: !758, line: 27, type: !62, isLocal: false, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "bbdNumBlocks", scope: !757, file: !758, line: 29, type: !62, isLocal: false, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "sbdNumber", scope: !757, file: !758, line: 32, type: !62, isLocal: false, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "sbdStart", scope: !757, file: !758, line: 32, type: !62, isLocal: false, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "sbdLen", scope: !757, file: !758, line: 32, type: !62, isLocal: false, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "propCurNumber", scope: !757, file: !758, line: 36, type: !62, isLocal: false, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "propLen", scope: !757, file: !758, line: 36, type: !62, isLocal: false, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "propNumber", scope: !757, file: !758, line: 36, type: !62, isLocal: false, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "propStart", scope: !757, file: !758, line: 36, type: !62, isLocal: false, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "catdoc_read", scope: !757, file: !758, line: 634, type: !857, isLocal: false, isDefinition: true)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!6, !15, !6, !6, !765}
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "catdoc_eof", scope: !757, file: !758, line: 635, type: !862, isLocal: false, isDefinition: true)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!16, !765}
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "catdoc_seek", scope: !757, file: !758, line: 636, type: !867, isLocal: false, isDefinition: true)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!16, !765, !62, !16}
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "catdoc_tell", scope: !757, file: !758, line: 637, type: !872, isLocal: false, isDefinition: true)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!62, !765}
!875 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!876 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!877 = !{!"clang version 6.0.0 (tags/RELEASE_600/final)"}
!878 = !{i32 1, !"wchar_size", i32 4}
!879 = !{i32 2, !"Dwarf Version", i32 4}
!880 = !{i32 2, !"Debug Info Version", i32 3}
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !883)
!882 = !DIFile(filename: "fileutil.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!883 = !{!15, !884, !9, !17, !11, !14}
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !885, line: 29, baseType: !8)
!885 = !DIFile(filename: "/usr/include/glob.h", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 6.0.0 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !888)
!887 = !DIFile(filename: "numutils.c", directory: "/home/zhangzheng1/zhangzheng1/codes/myUtilities/LLVMPass/llvm-pass-skeleton/collectCMP/catdoc-38a2807/src")
!888 = !{!64, !62, !8}
!889 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 38, type: !890, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !892)
!890 = !DISubroutineType(types: !891)
!891 = !{!16, !16, !298}
!892 = !{!893, !894, !895, !896, !897, !898, !899, !900, !901, !903, !904, !908, !909, !911, !912, !914, !917, !918, !920, !921, !927, !928, !930}
!893 = !DILocalVariable(name: "argc", arg: 1, scope: !889, file: !3, line: 38, type: !16)
!894 = !DILocalVariable(name: "argv", arg: 2, scope: !889, file: !3, line: 38, type: !298)
!895 = !DILocalVariable(name: "f", scope: !889, file: !3, line: 39, type: !30)
!896 = !DILocalVariable(name: "c", scope: !889, file: !3, line: 40, type: !16)
!897 = !DILocalVariable(name: "i", scope: !889, file: !3, line: 40, type: !16)
!898 = !DILocalVariable(name: "tempname", scope: !889, file: !3, line: 41, type: !14)
!899 = !DILocalVariable(name: "tmp_charset", scope: !889, file: !3, line: 42, type: !304)
!900 = !DILocalVariable(name: "stdin_processed", scope: !889, file: !3, line: 43, type: !16)
!901 = !DILocalVariable(name: "__len", scope: !902, file: !3, line: 50, type: !6)
!902 = distinct !DILexicalBlock(scope: !889, file: !3, line: 50, column: 21)
!903 = !DILocalVariable(name: "__retval", scope: !902, file: !3, line: 50, type: !14)
!904 = !DILocalVariable(name: "__len", scope: !905, file: !3, line: 72, type: !6)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 72, column: 17)
!906 = distinct !DILexicalBlock(scope: !907, file: !3, line: 60, column: 14)
!907 = distinct !DILexicalBlock(scope: !889, file: !3, line: 59, column: 57)
!908 = !DILocalVariable(name: "__retval", scope: !905, file: !3, line: 72, type: !14)
!909 = !DILocalVariable(name: "__len", scope: !910, file: !3, line: 75, type: !6)
!910 = distinct !DILexicalBlock(scope: !906, file: !3, line: 75, column: 17)
!911 = !DILocalVariable(name: "__retval", scope: !910, file: !3, line: 75, type: !14)
!912 = !DILocalVariable(name: "endptr", scope: !913, file: !3, line: 90, type: !14)
!913 = distinct !DILexicalBlock(scope: !906, file: !3, line: 89, column: 14)
!914 = !DILocalVariable(name: "__s1_len", scope: !915, file: !3, line: 114, type: !6)
!915 = distinct !DILexicalBlock(scope: !916, file: !3, line: 114, column: 6)
!916 = distinct !DILexicalBlock(scope: !889, file: !3, line: 114, column: 6)
!917 = !DILocalVariable(name: "__s2_len", scope: !915, file: !3, line: 114, type: !6)
!918 = !DILocalVariable(name: "__s2", scope: !919, file: !3, line: 114, type: !17)
!919 = distinct !DILexicalBlock(scope: !915, file: !3, line: 114, column: 6)
!920 = !DILocalVariable(name: "__result", scope: !919, file: !3, line: 114, type: !16)
!921 = !DILocalVariable(name: "__s1_len", scope: !922, file: !3, line: 160, type: !6)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 160, column: 8)
!923 = distinct !DILexicalBlock(scope: !924, file: !3, line: 160, column: 7)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 159, column: 28)
!925 = distinct !DILexicalBlock(scope: !926, file: !3, line: 159, column: 2)
!926 = distinct !DILexicalBlock(scope: !889, file: !3, line: 159, column: 2)
!927 = !DILocalVariable(name: "__s2_len", scope: !922, file: !3, line: 160, type: !6)
!928 = !DILocalVariable(name: "__s2", scope: !929, file: !3, line: 160, type: !17)
!929 = distinct !DILexicalBlock(scope: !922, file: !3, line: 160, column: 8)
!930 = !DILocalVariable(name: "__result", scope: !929, file: !3, line: 160, type: !16)
!931 = !DILocation(line: 38, column: 14, scope: !889)
!932 = !DILocation(line: 38, column: 27, scope: !889)
!933 = !DILocation(line: 43, column: 6, scope: !889)
!934 = !DILocation(line: 48, column: 2, scope: !889)
!935 = !DILocation(line: 50, column: 21, scope: !902)
!936 = !DILocation(line: 50, column: 21, scope: !937)
!937 = distinct !DILexicalBlock(scope: !902, file: !3, line: 50, column: 21)
!938 = !DILocation(line: 50, column: 36, scope: !889)
!939 = !DILocation(line: 50, column: 11, scope: !889)
!940 = !DILocation(line: 41, column: 8, scope: !889)
!941 = !DILocation(line: 51, column: 6, scope: !942)
!942 = distinct !DILexicalBlock(scope: !889, file: !3, line: 51, column: 6)
!943 = !DILocation(line: 51, column: 6, scope: !889)
!944 = !DILocation(line: 52, column: 3, scope: !945)
!945 = distinct !DILexicalBlock(scope: !942, file: !3, line: 51, column: 16)
!946 = !DILocation(line: 53, column: 3, scope: !945)
!947 = !DILocation(line: 54, column: 2, scope: !945)
!948 = !DILocation(line: 57, column: 2, scope: !889)
!949 = !DILocation(line: 59, column: 2, scope: !889)
!950 = !DILocation(line: 59, column: 12, scope: !889)
!951 = !DILocation(line: 40, column: 6, scope: !889)
!952 = !DILocation(line: 62, column: 34, scope: !906)
!953 = !{!954, !954, i64 0}
!954 = !{!"any pointer", !955, i64 0}
!955 = !{!"omnipotent char", !956, i64 0}
!956 = !{!"Simple C/C++ TBAA"}
!957 = !DILocation(line: 62, column: 5, scope: !906)
!958 = !DILocation(line: 63, column: 20, scope: !906)
!959 = !{!960, !960, i64 0}
!960 = !{!"int", !955, i64 0}
!961 = !DILocation(line: 64, column: 5, scope: !906)
!962 = !DILocation(line: 66, column: 32, scope: !906)
!963 = !DILocation(line: 66, column: 5, scope: !906)
!964 = !DILocation(line: 67, column: 5, scope: !906)
!965 = !DILocation(line: 69, column: 17, scope: !906)
!966 = !DILocation(line: 69, column: 16, scope: !906)
!967 = !DILocation(line: 70, column: 5, scope: !906)
!968 = !DILocation(line: 72, column: 17, scope: !905)
!969 = !DILocation(line: 72, column: 17, scope: !970)
!970 = distinct !DILexicalBlock(scope: !905, file: !3, line: 72, column: 17)
!971 = !DILocation(line: 72, column: 16, scope: !906)
!972 = !DILocation(line: 73, column: 5, scope: !906)
!973 = !DILocation(line: 75, column: 17, scope: !910)
!974 = !DILocation(line: 75, column: 17, scope: !975)
!975 = distinct !DILexicalBlock(scope: !910, file: !3, line: 75, column: 17)
!976 = !DILocation(line: 75, column: 16, scope: !906)
!977 = !DILocation(line: 76, column: 5, scope: !906)
!978 = !DILocation(line: 78, column: 22, scope: !906)
!979 = !DILocation(line: 79, column: 5, scope: !906)
!980 = !DILocation(line: 81, column: 22, scope: !906)
!981 = !DILocation(line: 82, column: 5, scope: !906)
!982 = !DILocation(line: 84, column: 12, scope: !906)
!983 = !DILocation(line: 85, column: 5, scope: !906)
!984 = !DILocation(line: 87, column: 16, scope: !906)
!985 = !DILocation(line: 88, column: 5, scope: !906)
!986 = !DILocation(line: 90, column: 9, scope: !913)
!987 = !DILocation(line: 91, column: 35, scope: !913)
!988 = !DILocation(line: 90, column: 15, scope: !913)
!989 = !DILocation(line: 91, column: 28, scope: !913)
!990 = !DILocation(line: 91, column: 23, scope: !913)
!991 = !DILocation(line: 91, column: 21, scope: !913)
!992 = !DILocation(line: 92, column: 14, scope: !993)
!993 = distinct !DILexicalBlock(scope: !913, file: !3, line: 92, column: 13)
!994 = !DILocation(line: 92, column: 13, scope: !993)
!995 = !{!955, !955, i64 0}
!996 = !DILocation(line: 92, column: 13, scope: !913)
!997 = !DILocation(line: 93, column: 18, scope: !998)
!998 = distinct !DILexicalBlock(scope: !993, file: !3, line: 92, column: 22)
!999 = !DILocation(line: 93, column: 60, scope: !998)
!1000 = !DILocation(line: 93, column: 10, scope: !998)
!1001 = !DILocation(line: 94, column: 10, scope: !998)
!1002 = !DILocation(line: 97, column: 8, scope: !906)
!1003 = !DILocation(line: 98, column: 14, scope: !906)
!1004 = !DILocation(line: 98, column: 31, scope: !906)
!1005 = !DILocation(line: 99, column: 30, scope: !906)
!1006 = !DILocation(line: 99, column: 34, scope: !906)
!1007 = !DILocation(line: 100, column: 29, scope: !906)
!1008 = !DILocation(line: 100, column: 34, scope: !906)
!1009 = distinct !{!1009, !949, !1010}
!1010 = !DILocation(line: 107, column: 2, scope: !889)
!1011 = !DILocation(line: 101, column: 14, scope: !906)
!1012 = !DILocation(line: 102, column: 8, scope: !906)
!1013 = !DILocation(line: 104, column: 8, scope: !906)
!1014 = !DILocation(line: 105, column: 8, scope: !906)
!1015 = !DILocation(line: 108, column: 15, scope: !889)
!1016 = !DILocation(line: 108, column: 14, scope: !889)
!1017 = !DILocation(line: 109, column: 7, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !889, file: !3, line: 109, column: 6)
!1019 = !DILocation(line: 109, column: 6, scope: !889)
!1020 = !DILocation(line: 110, column: 11, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 109, column: 21)
!1022 = !DILocation(line: 110, column: 3, scope: !1021)
!1023 = !DILocation(line: 111, column: 2, scope: !1021)
!1024 = !DILocation(line: 112, column: 32, scope: !889)
!1025 = !DILocation(line: 112, column: 19, scope: !889)
!1026 = !DILocation(line: 112, column: 17, scope: !889)
!1027 = !DILocation(line: 113, column: 7, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !889, file: !3, line: 113, column: 6)
!1029 = !DILocation(line: 113, column: 6, scope: !889)
!1030 = !DILocation(line: 113, column: 23, scope: !1028)
!1031 = !DILocation(line: 114, column: 6, scope: !915)
!1032 = !DILocation(line: 114, column: 6, scope: !916)
!1033 = !DILocation(line: 115, column: 17, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !916, file: !3, line: 114, column: 38)
!1035 = !DILocation(line: 42, column: 13, scope: !889)
!1036 = !DILocation(line: 116, column: 8, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 116, column: 7)
!1038 = !DILocation(line: 116, column: 7, scope: !1034)
!1039 = !DILocation(line: 116, column: 21, scope: !1037)
!1040 = !DILocation(line: 117, column: 19, scope: !1034)
!1041 = !DILocation(line: 117, column: 17, scope: !1034)
!1042 = !DILocation(line: 118, column: 8, scope: !1034)
!1043 = !DILocation(line: 118, column: 3, scope: !1034)
!1044 = !DILocation(line: 119, column: 2, scope: !1034)
!1045 = !DILocation(line: 120, column: 18, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !916, file: !3, line: 119, column: 9)
!1047 = !DILocation(line: 122, column: 34, scope: !889)
!1048 = !DILocation(line: 122, column: 27, scope: !889)
!1049 = !DILocation(line: 122, column: 13, scope: !889)
!1050 = !DILocation(line: 122, column: 12, scope: !889)
!1051 = !DILocation(line: 123, column: 7, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !889, file: !3, line: 123, column: 6)
!1053 = !DILocation(line: 123, column: 6, scope: !889)
!1054 = !DILocation(line: 124, column: 11, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 123, column: 19)
!1056 = !DILocation(line: 124, column: 56, scope: !1055)
!1057 = !DILocation(line: 124, column: 3, scope: !1055)
!1058 = !DILocation(line: 126, column: 3, scope: !1055)
!1059 = !DILocation(line: 128, column: 36, scope: !889)
!1060 = !DILocation(line: 128, column: 29, scope: !889)
!1061 = !DILocation(line: 128, column: 15, scope: !889)
!1062 = !DILocation(line: 128, column: 14, scope: !889)
!1063 = !DILocation(line: 129, column: 7, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !889, file: !3, line: 129, column: 6)
!1065 = !DILocation(line: 129, column: 6, scope: !889)
!1066 = !DILocation(line: 130, column: 11, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 129, column: 21)
!1068 = !DILocation(line: 130, column: 55, scope: !1067)
!1069 = !DILocation(line: 130, column: 3, scope: !1067)
!1070 = !DILocation(line: 132, column: 3, scope: !1067)
!1071 = !DILocation(line: 135, column: 20, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !889, file: !3, line: 135, column: 6)
!1073 = !DILocation(line: 135, column: 19, scope: !1072)
!1074 = !DILocation(line: 135, column: 38, scope: !1072)
!1075 = !DILocation(line: 135, column: 36, scope: !1072)
!1076 = !DILocation(line: 135, column: 6, scope: !889)
!1077 = !DILocation(line: 136, column: 11, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 135, column: 51)
!1079 = !DILocation(line: 136, column: 3, scope: !1078)
!1080 = !DILocation(line: 137, column: 3, scope: !1078)
!1081 = !DILocation(line: 139, column: 21, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !889, file: !3, line: 139, column: 6)
!1083 = !DILocation(line: 139, column: 14, scope: !1082)
!1084 = !DILocation(line: 139, column: 7, scope: !1082)
!1085 = !DILocation(line: 139, column: 6, scope: !889)
!1086 = !DILocation(line: 140, column: 17, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 139, column: 31)
!1088 = !DILocation(line: 140, column: 16, scope: !1087)
!1089 = !DILocation(line: 141, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 141, column: 7)
!1091 = !DILocation(line: 141, column: 7, scope: !1087)
!1092 = !DILocation(line: 142, column: 17, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 142, column: 9)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 141, column: 22)
!1095 = !DILocation(line: 142, column: 9, scope: !1093)
!1096 = !DILocation(line: 142, column: 9, scope: !1094)
!1097 = !DILocation(line: 143, column: 5, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 142, column: 59)
!1099 = !DILocation(line: 144, column: 4, scope: !1098)
!1100 = !DILocation(line: 146, column: 12, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 145, column: 10)
!1102 = !DILocation(line: 146, column: 4, scope: !1101)
!1103 = !DILocation(line: 149, column: 2, scope: !889)
!1104 = !DILocation(line: 150, column: 6, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !889, file: !3, line: 150, column: 6)
!1106 = !DILocation(line: 150, column: 13, scope: !1105)
!1107 = !DILocation(line: 150, column: 6, scope: !889)
!1108 = !DILocation(line: 151, column: 21, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 151, column: 7)
!1110 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 150, column: 22)
!1111 = !DILocation(line: 151, column: 14, scope: !1109)
!1112 = !DILocation(line: 151, column: 7, scope: !1109)
!1113 = !DILocation(line: 151, column: 7, scope: !1110)
!1114 = !DILocation(line: 152, column: 4, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 151, column: 30)
!1116 = !DILocation(line: 153, column: 4, scope: !1115)
!1117 = !DILocation(line: 155, column: 7, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 155, column: 7)
!1119 = !DILocation(line: 155, column: 7, scope: !1110)
!1120 = !DILocation(line: 155, column: 29, scope: !1118)
!1121 = !DILocation(line: 155, column: 21, scope: !1118)
!1122 = !DILocation(line: 156, column: 25, scope: !1110)
!1123 = !DILocation(line: 156, column: 10, scope: !1110)
!1124 = !DILocation(line: 156, column: 3, scope: !1110)
!1125 = !DILocation(line: 40, column: 8, scope: !889)
!1126 = !DILocation(line: 159, column: 17, scope: !925)
!1127 = !DILocation(line: 159, column: 2, scope: !926)
!1128 = !DILocation(line: 160, column: 8, scope: !922)
!1129 = !DILocation(line: 160, column: 8, scope: !929)
!1130 = !DILocation(line: 160, column: 8, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !929, file: !3, line: 160, column: 8)
!1132 = !DILocation(line: 160, column: 8, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 160, column: 8)
!1134 = !DILocation(line: 160, column: 8, scope: !923)
!1135 = !DILocation(line: 160, column: 7, scope: !924)
!1136 = !DILocation(line: 161, column: 8, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 161, column: 8)
!1138 = distinct !DILexicalBlock(scope: !923, file: !3, line: 160, column: 29)
!1139 = !DILocation(line: 161, column: 8, scope: !1138)
!1140 = !DILocation(line: 162, column: 13, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 161, column: 25)
!1142 = !DILocation(line: 162, column: 5, scope: !1141)
!1143 = !DILocation(line: 163, column: 5, scope: !1141)
!1144 = !DILocation(line: 165, column: 8, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 165, column: 8)
!1146 = !DILocation(line: 165, column: 8, scope: !1138)
!1147 = !DILocation(line: 165, column: 30, scope: !1145)
!1148 = !DILocation(line: 165, column: 22, scope: !1145)
!1149 = !DILocation(line: 166, column: 19, scope: !1138)
!1150 = !DILocation(line: 166, column: 4, scope: !1138)
!1151 = !DILocation(line: 168, column: 3, scope: !1138)
!1152 = !DILocation(line: 169, column: 6, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !923, file: !3, line: 168, column: 10)
!1154 = !DILocation(line: 39, column: 8, scope: !889)
!1155 = !DILocation(line: 170, column: 9, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 170, column: 8)
!1157 = !DILocation(line: 170, column: 8, scope: !1153)
!1158 = !DILocation(line: 172, column: 5, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 170, column: 12)
!1160 = !DILocation(line: 173, column: 5, scope: !1159)
!1161 = !DILocation(line: 175, column: 8, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 175, column: 8)
!1163 = !DILocation(line: 175, column: 8, scope: !1153)
!1164 = !DILocation(line: 176, column: 9, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1166, file: !3, line: 176, column: 9)
!1166 = distinct !DILexicalBlock(scope: !1162, file: !3, line: 175, column: 22)
!1167 = !DILocation(line: 176, column: 9, scope: !1166)
!1168 = !DILocation(line: 177, column: 13, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 176, column: 53)
!1170 = !DILocation(line: 177, column: 6, scope: !1169)
!1171 = !DILocation(line: 178, column: 5, scope: !1169)
!1172 = !DILocation(line: 180, column: 6, scope: !1153)
!1173 = !DILocation(line: 181, column: 4, scope: !1153)
!1174 = !DILocation(line: 159, column: 24, scope: !925)
!1175 = distinct !{!1175, !1127, !1176}
!1176 = !DILocation(line: 183, column: 2, scope: !926)
!1177 = !DILocation(line: 185, column: 1, scope: !889)
!1178 = distinct !DISubprogram(name: "read_config_file", scope: !409, file: !409, line: 28, type: !132, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: true, unit: !408, variables: !1179)
!1179 = !{!1180, !1181, !1222, !1223, !1224, !1228, !1229, !1230, !1234, !1235, !1237, !1238, !1241, !1242, !1244, !1245, !1248, !1249, !1251, !1252, !1255, !1256, !1258, !1259, !1262, !1263, !1265, !1266, !1269, !1270, !1272, !1273, !1276, !1277, !1279, !1280, !1284}
!1180 = !DILocalVariable(name: "filename", arg: 1, scope: !1178, file: !409, line: 28, type: !11)
!1181 = !DILocalVariable(name: "f", scope: !1178, file: !409, line: 29, type: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 48, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !34, line: 241, size: 1728, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1184, file: !34, line: 242, baseType: !16, size: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1184, file: !34, line: 247, baseType: !14, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1184, file: !34, line: 248, baseType: !14, size: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1184, file: !34, line: 249, baseType: !14, size: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1184, file: !34, line: 250, baseType: !14, size: 64, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1184, file: !34, line: 251, baseType: !14, size: 64, offset: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1184, file: !34, line: 252, baseType: !14, size: 64, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1184, file: !34, line: 253, baseType: !14, size: 64, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1184, file: !34, line: 254, baseType: !14, size: 64, offset: 512)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1184, file: !34, line: 256, baseType: !14, size: 64, offset: 576)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1184, file: !34, line: 257, baseType: !14, size: 64, offset: 640)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1184, file: !34, line: 258, baseType: !14, size: 64, offset: 704)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1184, file: !34, line: 260, baseType: !1199, size: 64, offset: 768)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !34, line: 156, size: 192, elements: !1201)
!1201 = !{!1202, !1203, !1205}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1200, file: !34, line: 157, baseType: !1199, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1200, file: !34, line: 158, baseType: !1204, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1200, file: !34, line: 162, baseType: !16, size: 32, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1184, file: !34, line: 262, baseType: !1204, size: 64, offset: 832)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1184, file: !34, line: 264, baseType: !16, size: 32, offset: 896)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1184, file: !34, line: 268, baseType: !16, size: 32, offset: 928)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1184, file: !34, line: 270, baseType: !60, size: 64, offset: 960)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1184, file: !34, line: 274, baseType: !64, size: 16, offset: 1024)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1184, file: !34, line: 275, baseType: !66, size: 8, offset: 1040)
